{
  "_class_name": "FlaxUNet2DConditionModel",
  "_diffusers_version": "0.25.0.dev0",
  "addition_embed_type": null,
  "addition_embed_type_num_heads": 0,
  "addition_time_embed_dim": null,
  "attention_head_dim": 32,
  "block_out_channels": [
    320,
    640,
    1280
  ],
  "cross_attention_dim": 0,
  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "dropout": 0.0,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 3,
  "layers_per_block": 2,
  "num_attention_heads": null,
  "only_cross_attention": false,
  "out_channels": 3,
  "projection_class_embeddings_input_dim": null,
  "sample_size": 32,
  "split_head_dim": false,
  "transformer_layers_per_block": 1,
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D"
  ],
  "use_linear_projection": false,
  "use_memory_efficient_attention": false,
  "act_fn": "colu"
}